{
    "topics": [
        "State Space Model",
        "Vision Transformers",
        "Bidirectional SSMs",
        "Efficient Visual Backbones",
        "Image Classification",
        "Semantic Segmentation"
    ],
    "research": "Q1: Can a generic pure-state space model (SSM) backbone network effectively handle dense prediction tasks in vision without relying on self-attention?\n\nContribution: \nRecently the state space models (SSMs) with efficient hardware-aware designs, i.e., the Mamba deep learning model, have shown great potential for long sequence modeling. Meanwhile building efficient and generic vision backbones purely upon SSMs is an appealing direction. However, representing visual data is challenging for SSMs due to the position-sensitivity of visual data and the requirement of global context for visual understanding. In this paper, we show that the reliance on self-attention for visual representation learning is not necessary and propose a new generic vision backbone with bidirectional Mamba blocks (Vim), which marks the image sequences with position embeddings and compresses the visual representation with bidirectional state space models. On ImageNet classification, COCO object detection, and ADE20k\n\nProceedings of the 41 st International Conference on Machine Learning , Vienna, Austria. PMLR 235, 2024. Copyright 2024 by the author(s).\n\nsemantic segmentation tasks, Vim achieves higher performance compared to well-established vision transformers like DeiT, while also demonstrating significantly improved computation & memory efficiency. For example, Vim is 2.8 × faster than DeiT and saves 86.8% GPU memory when performing batch inference to extract features on images with a resolution of 1248 × 1248. The results demonstrate that Vim is capable of overcoming the computation & memory constraints on performing Transformer-style understanding for high-resolution images and it has great potential to be the next-generation backbone for vision foundation models.\n\nRecent research advancements have led to a surge of interest in the state space model (SSM). Originating from the classic Kalman filter model (Kalman, 1960), modern SSMs excel at capturing long-range dependencies and benefit from parallel training. Some SSM-based methods, such as the linear state-space layers (LSSL) (Gu et al., 2021b), structured state space sequence model (S4) (Gu et al., 2021a), diagonal state space (DSS) (Gupta et al., 2022), and S4D (Gu et al., 2022), are proposed to process sequence data across a wide range of tasks and modalities, particularly on modeling long-range dependencies. They are efficient in processing long sequences because of convolutional computation and near-linear computation. 2-D SSM (Baron et al., 2023), SGConvNeXt (Li et al., 2022b), and ConvSSM (Smith et al., 2023a) combine SSM with CNN or Transformer architecture to process 2-D data.\n\nVision Transformers (ViTs) have achieved great success in visual representation learning, excelling in large-scale self-supervised pre-training and high performance on downstream tasks. Compared with convolutional neural networks, the core advantage lies in that ViT can provide each image patch with data/patch-dependent global context through selfattention. This differs from convolutional networks that use the same parameters, i.e., the convolutional filters, for all positions. Another advantage is the modality-agnostic modeling by treating an image as a sequence of patches without 2D inductive bias, which makes it the preferred architecture for multimodal applications (Bavishi et al., 2023; Li et al., 2023; Liu et al., 2023). At the same time, the self-attention mechanism in Transformers poses challenges in terms of speed and memory usage when dealing with long-range visual dependencies, e.g., processing high-resolution images.\n\nMotivated by the success of Mamba in language modeling, it is appealing that we can also transfer this success from language to vision, i.e., to design a generic and efficient visual backbone with the advanced SSM method. However, there are two challenges for Mamba, i.e., unidirectional modeling and lack of positional awareness. To address these challenges, we propose the Vision Mamba (Vim) model, which incorporates the bidirectional SSMs for data-dependent global visual context modeling and position embeddings for location-aware visual recognition.\n\nQ2: How does the proposed Vision Mamba (Vim) model address the computation & memory constraints on performing Transformer-style understanding for high-resolution images?",
    "method": "Methodology: The authors employ a novel approach in computer vision by leveraging the recently developed Mamba deep learning model with structured state space sequence models (SSSMs) to tackle visual representation learning and Transformer-style understanding for high-resolution images. The core methodology involves the following:\n\n*   Utilizing bidirectional Mamba blocks, dubbed Vim (Vision Mamba), which incorporate position embeddings and employ bidirectional state space models to compress visual representations.\n*   Employing a new generic vision backbone with the Vim block, specifically designed to overcome computation and memory constraints for high-resolution images.\n*   Training the proposed architecture on ImageNet classification, COCO object detection, and ADE20k semantic segmentation tasks.\n*   Demonstrating improved performance compared to well-established vision transformers like DeiT, while also showcasing significant advantages in terms of computational efficiency.",
    "results": "Results: The authors report that their proposed Vision Mamba (Vim) model achieves higher performance compared to well-established vision transformers like DeiT on ImageNet classification, COCO object detection, and ADE20k semantic segmentation tasks. Specifically, Vim is 2.8 times faster than DeiT and saves 86.8% GPU memory when performing batch inference. The authors also demonstrate that Vim can overcome computation and memory constraints for high-resolution images, making it a promising next-generation vision backbone.\n\nThe results contribute to addressing the research question by providing evidence for the potential of state space models (SSMs) as generic vision backbones. By leveraging bidirectional SSM modeling with position embeddings, Vim achieves data-dependent global visual context without introducing image-specific inductive biases. The findings also advance the field by showcasing the efficiency and effectiveness of Vim on standard computer vision benchmarks.\n\nQualitatively, the results suggest that Vim has great potential to be a next-generation vision backbone, offering improved performance and efficiency compared to existing models like DeiT."
}